#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jeff-spradlin-org/aws-demo-api/runs/run-4pebqXJehXTUdgtc

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.network.data.aws_caller_identity.current: Refreshing...
module.network.data.aws_caller_identity.current: Refresh complete after 0s [id=473900615621]
module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a47c002935c2ee32]
module.network.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03147f5a394f1b282]
module.network.aws_security_group.this: Refreshing state... [id=sg-03988158d5d7ae839]
module.network.aws_network_acl.this: Refreshing state... [id=acl-01037d5cf5c3fc134]
module.network.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-022da1c2195155b09]
module.network.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0ed519bddffa89a41]
module.network.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ed09661a37b1b1b5]
module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e9638a84701dbb55]
module.network.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ceb41246f531d52b]
module.network.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-081cac192344c340f]
module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a6ca3f58bfc1b16e]
module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0adb831b2832e9722]
module.network.aws_network_acl_rule.default_egress: Refreshing state... [id=nacl-4137658509]
module.network.aws_network_acl_rule.default_ingress: Refreshing state... [id=nacl-162495592]
module.network.aws_security_group_rule.this["egress1"]: Refreshing state... [id=sgrule-1642956499]
module.network.aws_security_group_rule.this["ingress443"]: Refreshing state... [id=sgrule-1655540042]
module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b8a1e750d958f0db]
module.network.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d532636703f8b1cd]
module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07ea3ccbc06f699cc]
module.instance.module.aws_instance01[0].aws_instance.this[0]: Refreshing state... [id=i-0e64d69732890d0b4]
module.instance.module.aws_instance01[4].aws_instance.this[0]: Refreshing state... [id=i-0c3a80b1437efc600]
module.instance.module.aws_instance01[2].aws_instance.this[0]: Refreshing state... [id=i-08f8bc50a3e21289e]
module.instance.module.aws_instance01[5].aws_instance.this[0]: Refreshing state... [id=i-0b592995bf0467cbc]
module.instance.module.aws_instance01[1].aws_instance.this[0]: Refreshing state... [id=i-09bd1d528c9f38cb9]
module.instance.module.aws_instance01[3].aws_instance.this[0]: Refreshing state... [id=i-07c38689bf1a7eb81]
module.network.aws_network_acl.this: Drift detected (update)
module.network.aws_security_group.this: Drift detected (update)
module.network.aws_security_group_rule.this["egress1"]: Drift detected (update)
module.network.aws_security_group_rule.this["ingress443"]: Drift detected (update)
module.network.module.vpc.aws_default_network_acl.this[0]: Drift detected (update)
module.network.module.vpc.aws_default_route_table.default[0]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.instance.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.network.aws_network_acl.this will be updated in-place
  ~ resource "aws_network_acl" "this" {
        id         = "acl-01037d5cf5c3fc134"
      ~ tags       = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all   = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.network.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-03988158d5d7ae839"
        name                   = "api-api-lab01-allow_private"
      ~ tags                   = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.instance.module.aws_instance01[0].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.instance.module.aws_instance01[0].data.aws_ssm_parameter.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "this" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.instance.module.aws_instance01[0].aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-0cc87e5027adcdca8" # forces replacement -> (known after apply) # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-2:473900615621:instance/i-0e64d69732890d0b4" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e64d69732890d0b4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-07a6d33113461957d" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-16.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.16" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-01"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-01"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ volume_tags                          = {
          - "Name" = "lab-test-api-15-May-23-01"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      ~ credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d85a9ac88758724f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.instance.module.aws_instance01[1].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.instance.module.aws_instance01[1].data.aws_ssm_parameter.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "this" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.instance.module.aws_instance01[1].aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-0cc87e5027adcdca8" # forces replacement -> (known after apply) # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-2:473900615621:instance/i-09bd1d528c9f38cb9" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-2b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-09bd1d528c9f38cb9" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-063f42ea463141d99" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-48.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.48" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-02"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-02"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ volume_tags                          = {
          - "Name" = "lab-test-api-15-May-23-02"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      ~ credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06bb41087a8604146" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.instance.module.aws_instance01[2].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.instance.module.aws_instance01[2].data.aws_ssm_parameter.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "this" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.instance.module.aws_instance01[2].aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-0cc87e5027adcdca8" # forces replacement -> (known after apply) # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-2:473900615621:instance/i-08f8bc50a3e21289e" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-2c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-08f8bc50a3e21289e" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-09032821085660e64" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-75.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.75" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-03"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-03"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ volume_tags                          = {
          - "Name" = "lab-test-api-15-May-23-03"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      ~ credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0682f9f8b436de717" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.instance.module.aws_instance01[3].aws_instance.this[0] will be destroyed
  # (because module.instance.module.aws_instance01[3] is not in configuration)
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0cc87e5027adcdca8" -> null
      - arn                                  = "arn:aws:ec2:us-east-2:473900615621:instance/i-07c38689bf1a7eb81" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-2a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-07c38689bf1a7eb81" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.nano" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = true -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0d6ba2c70f0edd6bc" -> null
      - private_dns                          = "ip-10-0-2-25.us-east-2.compute.internal" -> null
      - private_ip                           = "10.0.2.25" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0adb831b2832e9722" -> null
      - tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-04"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> null
      - tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-04"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - volume_tags                          = {
          - "Name" = "lab-test-api-15-May-23-04"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-03988158d5d7ae839",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08dace463468d8c88" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.instance.module.aws_instance01[4].aws_instance.this[0] will be destroyed
  # (because module.instance.module.aws_instance01[4] is not in configuration)
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0cc87e5027adcdca8" -> null
      - arn                                  = "arn:aws:ec2:us-east-2:473900615621:instance/i-0c3a80b1437efc600" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-2b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0c3a80b1437efc600" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.nano" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = true -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0539770fa1bcf1e12" -> null
      - private_dns                          = "ip-10-0-2-52.us-east-2.compute.internal" -> null
      - private_ip                           = "10.0.2.52" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0a6ca3f58bfc1b16e" -> null
      - tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-05"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> null
      - tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-05"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - volume_tags                          = {
          - "Name" = "lab-test-api-15-May-23-05"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-03988158d5d7ae839",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-065cdc9bf83b820be" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.instance.module.aws_instance01[5].aws_instance.this[0] will be destroyed
  # (because module.instance.module.aws_instance01[5] is not in configuration)
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0cc87e5027adcdca8" -> null
      - arn                                  = "arn:aws:ec2:us-east-2:473900615621:instance/i-0b592995bf0467cbc" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-2c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0b592995bf0467cbc" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.nano" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = true -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0ff0ab0c5f73be755" -> null
      - private_dns                          = "ip-10-0-2-69.us-east-2.compute.internal" -> null
      - private_ip                           = "10.0.2.69" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-081cac192344c340f" -> null
      - tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-06"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> null
      - tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:26Z"
          - "Name"             = "lab-test-api-15-May-23-06"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "module"           = "terraform-aws-network"
          - "source"           = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - volume_tags                          = {
          - "Name" = "lab-test-api-15-May-23-06"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-03988158d5d7ae839",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ab8b5c792df8dbad" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.network.module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-0ed09661a37b1b1b5"
      ~ tags                   = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-default"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-default"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.network.module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-03147f5a394f1b282"
      ~ tags                   = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-default"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-default"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-022da1c2195155b09"
        name                   = "default"
      ~ tags                   = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-default"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-default"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e9638a84701dbb55"
      ~ tags             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2a"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2a"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0ceb41246f531d52b"
      ~ tags             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2b"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2b"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0ed519bddffa89a41"
      ~ tags             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2c"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2c"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0adb831b2832e9722"
      ~ tags                                           = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2a"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2a"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a6ca3f58bfc1b16e"
      ~ tags                                           = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2b"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2b"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-081cac192344c340f"
      ~ tags                                           = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2c"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01-private-us-east-2c"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.network.module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0a47c002935c2ee32"
      ~ tags                                 = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
          - "LastModifiedBy"   = "arn:aws:iam::473900615621:user/tfc"
          - "LastModifiedTime" = "2023-05-15T19:25:13Z"
          - "Name"             = "api-api-lab01"
          - "billable"         = "true"
          - "costCenter"       = "IT"
          - "department"       = "Infrastructure"
          - "environment"      = "API"
          - "kickoff"          = "true"
          - "module"           = "aws-network"
          - "source"           = "Terraform"
        } -> (known after apply)
        # (16 unchanged attributes hidden)
    }

Plan: 3 to add, 12 to change, 6 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 6 of 9 estimated
           $12.9456/mo -$17.7455999999999952

```

</details>

*Pushed by: @jmspradlin, Action: `pull_request`*